src/InformationRegisters/ОбращенияКМетодам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбращенияКМетодам</Name>
			<Comment>DEV-10129</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Метаданные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Методы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаВызова</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОбращенияКМетодам/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(Метаданные, ТочкаОбращения, ТочкаВызова, Количество) Экспорт  
	
	МенеджерЗаписи = РегистрыСведений.ОбращенияКМетодам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Активность = Истина;
	МенеджерЗаписи.Метаданные = Метаданные;
	МенеджерЗаписи.ТочкаОбращения = ТочкаОбращения;
	МенеджерЗаписи.ТочкаВызова = ТочкаВызова; 
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Количество = 0 Тогда
		МенеджерЗаписи.Метаданные = Метаданные;
		МенеджерЗаписи.ТочкаОбращения = ТочкаОбращения;
		МенеджерЗаписи.ТочкаВызова = ТочкаВызова;
		МенеджерЗаписи.Количество = Количество;
		МенеджерЗаписи.Записать(Ложь);
	Иначе
		МенеджерЗаписи.Количество = Количество;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры  

Процедура УдалитьЗапись(Метаданные, ТочкаОбращения, ТочкаВызова) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОбращенияКМетодам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Метаданные = Метаданные;
	МенеджерЗаписи.ТочкаОбращения = ТочкаОбращения;
	МенеджерЗаписи.ТочкаВызова = ТочкаВызова;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Удалить();

КонецПроцедуры
